In [2]:
import pandas as pd

In [3]:
csv_df=pd.read_csv('retail_sales_dataset.csv')

json_df=pd.read_json('retailsalesdata.json')

excel_df=pd.read_excel('retail_sales.xlsx')

In [4]:
csv_df.head()

,Transaction ID,Date,Customer ID,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,24-11-2023,CUST001,34,Beauty,3,50,150
1,2,27-02-2023,CUST002,26,Clothing,2,500,1000
2,3,13-01-2023,CUST003,50,Electronics,1,30,30
3,4,21-05-2023,CUST004,37,Clothing,1,500,500
4,5,06-05-2023,CUST005,30,Beauty,2,50,100

In [5]:
csv_df.shape

(1001, 8)

In [6]:
csv_df = csv_df.drop_duplicates(subset=['Transaction ID', 'Customer ID'])

In [7]:
json_df.head()

,transaction_id,date,store_id,customer_id,product_id,quantity,price_per_unit,total_sale,age
0,T001,2024-01-01,S001,C001,P001,2,19.99,39.98,32
1,T002,2024-01-02,S002,C002,P002,1,29.99,29.99,45
2,T003,2024-01-03,S001,C003,P003,5,9.99,49.95,27
3,T004,2024-01-04,S003,C001,P001,1,19.99,19.99,32
4,T005,2024-01-05,S002,C004,P002,3,29.99,89.97,39

In [8]:
json_df = json_df.drop(columns=['store_id'])

In [9]:
json_df.shape

(30, 8)

In [10]:
json_df = json_df.drop_duplicates(subset=['transaction_id', 'customer_id'])

In [11]:
excel_df.head()

,Transaction ID,Date,Customer ID,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,30,Beauty,2,50,100

In [12]:
excel_df.shape

(1000, 8)

In [13]:
excel_df = excel_df.drop_duplicates(subset=['Transaction ID', 'Customer ID'])

In [14]:
json_df['date']=pd.to_datetime(json_df['date'])

In [15]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
csv_df['Product Category'] = label_encoder.fit_transform(csv_df['Product Category'])
json_df['product_id'] = label_encoder.fit_transform(json_df['product_id'])
excel_df['Product Category'] = label_encoder.fit_transform(excel_df['Product Category'])

In [16]:
excel_df=excel_df.rename(columns={"Price per Unit":"price_per_unit","Age":"age","Quantity":"quantity","Date":"date","Transaction ID":"transaction_id","Total Amount":"total_sale","Customer ID":"customer_id","Product Category":"product_id"})

In [17]:
csv_df=csv_df.rename(columns={"Price per Unit":"price_per_unit","Age":"age","Quantity":"quantity","Date":"date","Transaction ID":"transaction_id","Total Amount":"total_sale","Customer ID":"customer_id","Product Category":"product_id"})

In [18]:
combined_df=pd.concat([csv_df,json_df,excel_df],axis=0,ignore_index=True)
combined_df.head()

,transaction_id,date,customer_id,age,product_id,quantity,price_per_unit,total_sale
0,1,24-11-2023,CUST001,34,0,3,50.0,150.0
1,2,27-02-2023,CUST002,26,1,2,500.0,1000.0
2,3,13-01-2023,CUST003,50,2,1,30.0,30.0
3,4,21-05-2023,CUST004,37,1,1,500.0,500.0
4,5,06-05-2023,CUST005,30,0,2,50.0,100.0

In [19]:
combined_df.shape

(2022, 8)

In [20]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2022 entries, 0 to 2021
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  2022 non-null   object
 1   date            2022 non-null   object
 2   customer_id     2022 non-null   object
 3   age             2022 non-null   int64
 4   product_id      2022 non-null   int32
 5   quantity        2022 non-null   int64
 6   price_per_unit  2022 non-null   float64
 7   total_sale      2022 non-null   float64
dtypes: float64(2), int32(1), int64(2), object(3)
memory usage: 118.6+ KB

In [21]:
combined_df.to_csv("retailsalescombinedoutput.csv")